![png](Data/movies-ERD.png)

In [1]:
import pandas as pd
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "Encychlamydia1" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
connection = f"mysql+pymysql://{username}:{password}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [5]:
title_basics = pd.read_csv("Data/title.basics.csv")
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86979 non-null  int64
 1   tconst          86979 non-null  object
 2   titleType       86979 non-null  object
 3   primaryTitle    86979 non-null  object
 4   originalTitle   86979 non-null  object
 5   isAdult         86979 non-null  int64
 6   startYear       86979 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86979 non-null  int64
 9   genres          86979 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [6]:
title_basics = title_basics.drop(columns=['Unnamed: 0','titleType','isAdult','endYear','originalTitle','genres'])
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [7]:
ratings = pd.read_csv('Data/title.ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     71900 non-null  int64
 1   tconst         71900 non-null  object
 2   averageRating  71900 non-null  float64
 3   numVotes       71900 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.2+ MB

   Unnamed: 0     tconst  averageRating  numVotes
0       17961  tt0035423            6.4     87153
1       40764  tt0062336            6.4       175
2       46645  tt0069049            6.7      7754
3       63640  tt0088751            5.2       336
4       69953  tt0096056            5.6       846

In [8]:
ratings = ratings.drop(columns=['Unnamed: 0'])
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [9]:
q = '''SELECT * FROM title_basics;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, primary_title, start_year, runtime]
Index: []

In [10]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(256)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [11]:
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime'], dtype=object)

In [12]:
title_basics.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes'], dtype='object')

In [13]:
rename_map = {"primaryTitle":"primary_title","startYear":"start_year","runtimeMinutes":"runtime"}
title_basics = title_basics.rename(rename_map, axis=1)
title_basics.head(2)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70

In [14]:
describe[['Field','Type']]

           Field          Type
0         tconst   varchar(10)
1  primary_title  varchar(256)
2     start_year           int
3        runtime           int

In [15]:
title_basics.dtypes

tconst            object
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [16]:
title_basics['start_year'] = title_basics['start_year'].astype(int)
title_basics['start_year'].dtypes

dtype('int32')

In [17]:
q = '''SELECT * FROM ratings;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, average_rating, number_of_votes]
Index: []

In [18]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, engine)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(10)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [19]:
describe['Field'].values

array(['tconst', 'average_rating', 'number_of_votes'], dtype=object)

In [20]:
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [21]:
rename_map = {"averageRating":"average_rating","numVotes":"number_of_votes"}
ratings = ratings.rename(rename_map,axis=1)
ratings.head(2)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175

In [22]:
describe[['Field','Type']]

             Field         Type
0           tconst  varchar(10)
1   average_rating        float
2  number_of_votes          int

In [23]:
ratings.dtypes

tconst              object
average_rating     float64
number_of_votes      int64
dtype: object

In [24]:
title_basics.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [25]:
ratings.to_sql("ratings",conn,index=False, if_exists='append')

71900

In [26]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [27]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(256)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [28]:
q = '''SELECT * FROM title_basics LIMIT 5;'''
pd.read_sql(q, conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [30]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, engine)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(10)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [31]:
q = '''SELECT * FROM ratings LIMIT 5;'''
pd.read_sql(q, conn)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [32]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [34]:
q = '''SELECT * FROM genres;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [35]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, engine)
describe

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [36]:
q = '''SELECT * FROM title_genres;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []